### MACHINE LEARNING LABBORATORY
### Roll No: 21BDA30

<i><b>Loops</b></i>

In [1]:
for i in range(5):
    print (i**2)

0
1
4
9
16

In [2]:
marks = [76,45,15,57,23,98]

In [3]:
for i in range(len(marks)):
    print (marks[i])

76
45
15
57
23
98

In [4]:
#Python specific way
for mark in marks:
    print (mark)

76
45
15
57
23
98

<i><b>Conditions</b></i>

In [5]:
pass_mark=28

In [6]:
for mark in marks:
    if mark<pass_mark and mark>20:
        print("Grace Marks Awarded")
    elif mark<pass_mark:
        print("Fail")
    else:
        print("Pass")
print("_____________________________")

Pass
Pass
Fail
Pass
Grace Marks Awarded
Pass
_____________________________

<i><b>Dictionary</b></i>

In [7]:
l1 = list("RAINBOW")
l1

['R', 'A', 'I', 'N', 'B', 'O', 'W']

<i><b>Functions</b></i>

In [8]:
def sum_of(a,b):
    return(a+b)

In [9]:
sum_of(23,56)

79

In [10]:
def diff_of(fno=0,sco=0):
    return(fno-sco)

<i><b>Packages in Python for Data Science</b></i>

In [11]:
#Pandas, Numpy, Scipy, Matplotlib, Sklearn
#Scikit

<i><b>Working with Pandas</b></i>

In [12]:
import pandas as pd

In [13]:
marks_series=pd.Series([45,12,34,87,23,78])

In [14]:
marks_series.index

RangeIndex(start=0, stop=6, step=1)

In [15]:
marks_series.values

array([45, 12, 34, 87, 23, 78], dtype=int64)

In [16]:
marks_series[1:]

1    12
2    34
3    87
4    23
5    78
dtype: int64

In [17]:
marks_series[:4]

0    45
1    12
2    34
3    87
dtype: int64

In [18]:
marks_series[5:]=45

In [19]:
marks_series

0    45
1    12
2    34
3    87
4    23
5    45
dtype: int64

In [20]:
marks_series.value_counts()

45    2
87    1
12    1
34    1
23    1
dtype: int64

In [21]:
df1 = pd.DataFrame(marks)

In [22]:
df1

    0
0  76
1  45
2  15
3  57
4  23
5  98

In [23]:
df1.T

    0   1   2   3   4   5
0  76  45  15  57  23  98

In [24]:
df1.columns=['Col1']
df1

   Col1
0    76
1    45
2    15
3    57
4    23
5    98

In [29]:
df2 = pd.read_csv("tips.csv")

In [30]:
df2.head(10)

   table_number  total_bill   tip     sex smoker  day    time  size
0             3       16.99  1.01  Female     No  Sun  Dinner     2
1             6       10.34  1.66    Male     No  Sun  Dinner     3
2            16       21.01  3.50    Male     No  Sun  Dinner     3
3            12       23.68  3.31    Male     No  Sun  Dinner     2
4             2       24.59  3.61  Female     No  Sun  Dinner     4
5             3       25.29  4.71    Male     No  Sun  Dinner     4
6            11        8.77  2.00    Male     No  Sun  Dinner     2
7            14       26.88  3.12    Male     No  Sun  Dinner     4
8             5       15.04  1.96    Male     No  Sun  Dinner     2
9            12       14.78  3.23    Male     No  Sun  Dinner     2

In [31]:
df2.shape

(244, 8)

In [32]:
df2.isna().sum()

table_number    0
total_bill      0
tip             0
sex             0
smoker          0
day             0
time            0
size            0
dtype: int64

In [35]:
df2[['sex','smoker']]

        sex smoker
0    Female     No
1      Male     No
2      Male     No
3      Male     No
4    Female     No
5      Male     No
6      Male     No
7      Male     No
8      Male     No
9      Male     No
10     Male     No
11   Female     No
12     Male     No
13     Male     No
14   Female     No
15     Male     No
16   Female     No
17     Male     No
18   Female     No
19     Male     No
20     Male     No
21   Female     No
22   Female     No
23     Male     No
24     Male     No
25     Male     No
26     Male     No
27     Male     No
28     Male     No
29   Female     No
..      ...    ...
214  Female    Yes
215  Female    Yes
216    Male    Yes
217    Male    Yes
218    Male    Yes
219  Female    Yes
220    Male    Yes
221  Female    Yes
222    Male    Yes
223  Female     No
224    Male    Yes
225  Female    Yes
226  Female    Yes
227    Male     No
228    Male     No
229  Female    Yes
230    Male    Yes
231    Male    Yes
232    Male     No
233    Male     No
234    Male    Yes
235    Male     No
236    Male    Yes
237    Male    Yes
238  Female     No
239    Male     No
240  Female    Yes
241    Male    Yes
242    Male     No
243  Female     No

[244 rows x 2 columns]

In [38]:
name="Exotic"
lname=list(name)
new_dict={"Name":lname,"Values":marks}

In [39]:
new_df=pd.DataFrame(new_dict)

In [40]:
new_df

  Name  Values
0    E      76
1    x      45
2    o      15
3    t      57
4    i      23
5    c      98

In [42]:
df2[df2['tip']>0.5].shape

(244, 8)

In [43]:
df2.corr()

              table_number  total_bill       tip      size
table_number      1.000000   -0.042828 -0.091144  0.005621
total_bill       -0.042828    1.000000  0.675734  0.598315
tip              -0.091144    0.675734  1.000000  0.489299
size              0.005621    0.598315  0.489299  1.000000

In [44]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
table_number    244 non-null int64
total_bill      244 non-null float64
tip             244 non-null float64
sex             244 non-null object
smoker          244 non-null object
day             244 non-null object
time            244 non-null object
size            244 non-null int64
dtypes: float64(2), int64(2), object(4)
memory usage: 15.3+ KB

In [45]:
df2.describe()

       table_number  total_bill         tip        size
count    244.000000  244.000000  244.000000  244.000000
mean       8.561475   19.785943    2.998279    2.569672
std        4.583957    8.902412    1.383638    0.951100
min        1.000000    3.070000    1.000000    1.000000
25%        4.000000   13.347500    2.000000    2.000000
50%        9.000000   17.795000    2.900000    2.000000
75%       12.000000   24.127500    3.562500    3.000000
max       16.000000   50.810000   10.000000    6.000000